app/views/books/show.html.erb

<h2>Comments</h2>
<% @book.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 6]]