app/controllers/books_controller.rb

	def index
		@books = Book.all.order('created_at DESC')
---
SELECT "books".* FROM "books" ORDER BY created_at DESC

	def create
		@book = Book.new(book_params)
		if @book.save
---
INSERT INTO "books" ("title", "author", "description", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdfasd"], ["author", "addfsadf"], ["description", "asdasfd"], ["likes", 0], ["created_at", 2016-09-06 02:03:49 UTC], ["updated_at", 2016-09-06 02:03:49 UTC]]

	def update
		if @book.update(book_params)
---
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "dddfsdffsdfsdfsf"], ["updated_at", 2016-09-06 18:19:08 UTC], ["id", 3]]