app/controllers/comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@comment = @book.comments.create(comment_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "dfdsf"], ["body", "asdfasdf"], ["book_id", 6], ["created_at", 2016-09-06 20:16:24 UTC], ["updated_at", 2016-09-06 20:16:24 UTC]]