app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "John Appleseed"], ["created_at", 2016-09-10 23:09:22 UTC], ["updated_at", 2016-09-10 23:09:22 UTC], ["password_digest", "$2a$10$nBf9zgTKlck/Lo6uGkpLIumjo1xvCwy2l748lT7usS9Vu/JBOlCkm"]]